"P4_PROGRESS_TITLE" = "Perforce Progress";
"P4_ACTION_ADD" = "Adding…";
"P4_ACTION_DELETE" = "Deleting…";
"P4_ACTION_EDIT" = "Editing…";
"P4_ACTION_OPENED" = "Finding opened files…";
"P4_ACTION_PREPARING" = "Preparing…";
"P4_ACTION_REVERT_ONE" = "Reverting file…";
"P4_ACTION_REVERT_MULTI" = "Reverting files…";
"P4_ACTION_SYNC" = "Syncing…";
"P4_ACTION_LURKERS" = "Looking for lurkers…";
"P4_ACTION_STATUS" = "Fetching status…";
"P4_ACTION_FETCH_REVISION" = "Fetching revision…";

"SVN_CONFIRM_UPDATE_SINGLE" = "Save changes before updating “^1”?";
"SVN_CONFIRM_UPDATE_MULTI" = "Save changes before updating?";
"SVN_CONFIRM_UPDATE_SECONDARY" = "Updating will discard your unsaved changes.";
"SVN_CONFIRM_UPDATE_ACTION" = "Update";

"SVN_CONFIRM_COMMIT_SINGLE" = "Save changes before committing “^1”?";
"SVN_CONFIRM_COMMIT_MULTI" = "Save changes before committing?";
"SVN_CONFIRM_COMMIT_SECONDARY" = "Unsaved changes won’t be committed.";
"SVN_CONFIRM_COMMIT_ACTION" = "Commit";

"GENERIC_REVISION_PROMPT" = "Choose a revision:";
"COMPARE_SINGLE_REVISION_PROMPT" = "Compare against revision:";
"UPDATE_SINGLE_REVISION_PROMPT" = "Update to revision:";
"SYNC_SINGLE_REVISION_PROMPT" = "Sync to revision:";
"COMPARE_REVISION_ACTION" = "Compare";
"UPDATE_REVISION_ACTION" = "Update";
"SYNC_REVISION_ACTION" = "Sync";
"COMPARE_DUAL_REVISION_PROMPT_LEFT" = "Compare this revision:";
"COMPARE_DUAL_REVISION_PROMPT_RIGHT" = "To this revision:";
"COMPARE_REVISIONS_PROMPT_TITLE" = "Compare Revisions";
"COMPARE_REVISIONS_NO_DIFFS" = "No differences found.";

"SVN_COMMIT_FRONT_DOC_NO_COMMIT" = "This document doesn’t need to be committed.";
"SVN_COMMIT_SELECTED_FILES_NO_COMMIT" = "The selected items don’t need to be committed.";
"SVN_COMMIT_WC_NO_COMMIT" = "This working copy has no uncommitted changes.";

SVN_STATUS_ADDED = "Item is scheduled for Addition.";
SVN_STATUS_DELETED = "Item is scheduled for Deletion.";
SVN_STATUS_MODIFIED = "Item has been modified.";
SVN_STATUS_CONFLICT = "Item is in conflict with updates received from the repository.";
SVN_STATUS_NULL = "Item is not under version control.";
SVN_STATUS_MISSING = "Item is missing or incomplete.";
SVN_STATUS_WRONG_TYPE = "Item is versioned as a directory, but has been replaced by a file, or vice versa.";
SVN_STATUS_PROPS_MODIFIED = "Properties for this item have been modified.";
SVN_STATUS_PROPS_CONFLICT = "Properties for this item are in convlide with property updates received from the repository.";
SVN_STATUS_ADDED_HISTORY = "History scheduled with commit.";
SVN_STATUS_SWITCHED = "Item is switched.";
SVN_STATUS_LOCKED_WITH_TOKEN = "Item is locked in this working copy.";
SVN_STATUS_LOCKED_NO_TOKEN = "Item is locked in some other working copy.";
SVN_STATUS_LOCKED_STOLEN_TOKEN = "Item is locked, but the lock has been stolen.";
SVN_STATUS_LOCKED_BROKEN_TOKEN = "Item is unlocked; the lock has been broken.";
SVN_STATUS_OUT_OF_DATE = "A newer revision of this item exists in the repository.";
